Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: Where a two-story building or facility has one story or mezzanine with an occupant load of five or fewer persons that does not contain public use space, that story or mezzanine shall not be required to be connected by an accessible route to the story above or below.
fr_ca: Lorsqu'un bâtiment ou un établissement de deux étages comporte un étage ou une mezzanine dont la charge d'occupants est de cinq personnes ou moins et qui ne contient pas d'espace à usage public, cet étage ou cette mezzanine n'est pas tenu d'être relié par un itinéraire accessible à l'étage au-dessus ou au-dessous.

source: Where a vertical plane projecting from the edge of an exterior exit stairway or ramp and landings is exposed by other parts of the building at an angle of less than 180 degrees (3.14 rad), the exterior wall shall be rated in accordance with Section 1023.7.
fr_ca: Lorsqu'un plan vertical partant du bord d'un escalier ou d'une rampe d'issue extérieurs et des paliers est exposé par d'autres parties du bâtiment à un angle inférieur à 180 degrés (3,14 rad), le mur extérieur doit être classé selon la section 1023.7.

source: Where a wall-mounted demarcation line transitions to a floor-mounted demarcation line, or vice versa, the wall-mounted demarcation line shall drop vertically to the floor to meet a complimentary extension of the floor-mounted demarcation line, thus forming a continuous marking.
fr_ca: Lorsqu’une ligne de démarcation fixée au mur passe à une ligne de démarcation fixée au plancher, ou vice versa, la ligne de démarcation fixée au mur doit descendre verticalement jusqu’au plancher pour rejoindre un prolongement correspondant de la ligne de démarcation fixée au plancher, formant ainsi un marquage continu.

source: Where a water closet is positioned with a wall to the rear and to one side, the centerline of the water closet shall be 16 inches (405 mm) minimum and 18 inches (455 mm) maximum from the sidewall.
fr_ca: Lorsqu'il y a un mur à l'arrière et sur un côté de la cabine de toilette, la ligne d'axe de la cabine de toilette doit se trouver à une distance comprise entre 16 po [405 mm] et 18 po [455 mm] du mur latéral.

source: Where a wheelchair space is only entered from the side, the wheelchair space shall be 60 inches (1525 mm) minimum in depth.
fr_ca: Lorsqu'un espace pour fauteuil roulant est accessible uniquement par le côté, l'espace pour fauteuil roulant doit avoir une profondeur minimale de 60 po [1525 mm].

source: Where access to a public way cannot be provided, a safe dispersal area shall be provided where all of the following are met:
fr_ca: Lorsqu'il n'est pas possible de prévoir un accès à une voie publique, une zone de dispersion sûre doit être prévue lorsque toutes les conditions suivantes sont remplies :

source: Where adult changing stations are provided in a multiuser toilet or bathing room, the adult changing station shall be located in a compartment that includes all of the following components:
fr_ca: Lorsque des tables à langer pour adultes sont prévues dans une salle de toilettes ou une salle de bain à utilisateurs multiples, la table à langer pour adultes doit être située dans un compartiment qui comprend tous les éléments suivants :

source: Where adult changing stations are provided in a room or space other than a toilet or bathing room and including, but not limited to, nurses’ work areas, therapist work areas, or special education classrooms, the adult changing station shall be located in a compartment or room that includes all of the following components:
fr_ca: Lorsque des postes à langer pour adultes sont prévus dans une pièce ou une aire autre qu'une salle de toilette ou de bain, y compris, mais sans s'y limiter, les zones de travail des infirmières, les zones de travail des thérapeutes ou les salles de classe d'éducation spécialisée, le poste à langer pour adultes doit être situé dans un compartiment ou une pièce qui comprend tous les éléments suivants :

source: Where adult changing stations are provided in a toilet room with only one water closet and one lavatory, or in a family or assisted-use toilet or bathing room, the room shall provide all of the following components:
fr_ca: Lorsque des tables à langer pour adultes sont prévues dans une salle de toilettes avec une seule cabine de toilette et un seul lavabo, ou dans une toilette ou une salle de bain familiale ou à usage assisté, la pièce doit comporter tous les éléments suivants :

source: Where aisles are provided for seating, the distance shall be measured along the aisles and aisle accessways without travel over or on the seats.
fr_ca: Lorsque des allées sont prévues pour les sièges, la distance doit être mesurée le long des allées et des voies d'accès aux allées sans passer au-dessus ou sur les sièges.

source: Where aisles converge to form a single path of egress travel, the required capacity of that path shall be not less than the combined required capacity of the converging aisles.
fr_ca: Lorsque les allées convergent pour former un seul chemin de retraite, la capacité requise de ce chemin ne doit pas être inférieure à la capacité requise combinée des allées convergentes.

source: Where alterations, repairs or additions requiring a permit occur, the individual dwelling unit shall be equipped with carbon monoxide alarms located as required for new dwellings.
fr_ca: Lorsque des modifications, des réparations ou des ajouts nécessitant un permis sont effectués, le logement individuel doit être équipé de détecteurs de monoxyde de carbone situés conformément aux exigences pour les logements neufs.

source: Where alterations, repairs or additions requiring a permit occur, the individual dwelling unit shall be equipped with smoke alarms located as required for new dwellings.
fr_ca: Lorsque des modifications, des réparations ou des ajouts nécessitant un permis sont effectués, le logement individuel doit être équipé de détecteurs de fumée situés conformément aux exigences pour les logements neufs.

source: Where an accessible lavatory is located within the accessible water closet compartment at least one additional accessible lavatory shall be provided in the multicompartment toilet room outside the water closet compartment.
fr_ca: Lorsqu'un lavabo accessible est situé dans le compartiment de cabine de toilette accessible, au moins un autre lavabo accessible doit être prévu dans la salle de toilettes à compartiments multiples, à l'extérieur du compartiment de cabine de toilette.

source: Where an atrium contains an interior exit stairway all the following shall be met:
fr_ca: Lorsqu’un atrium contient un escalier d’issue intérieur, toutes les conditions suivantes doivent être respectées :

source: Where an automatic sprinkler system is provided, whether the sprinkler system is required.
fr_ca: Lorsqu’un système d'extincteurs automatiques est installé, si ce système est exigé.

source: Where an egress court serving a building or portion thereof is less than 10 feet (3048 mm) in width, the egress court walls shall have not less than 1-hour fire-resistance-rated construction for a distance of 10 feet (3048 mm) above the floor of the egress court.
fr_ca: Lorsque la cour d’évacuation desservant un bâtiment ou une partie de celui-ci a une largeur inférieure à 10 pi (3 048 mm), les murs de la cour d’évacuation doivent être constitués d’une construction présentant un degré de résistance au feu d’au moins 1 heure sur une hauteur de 10 pi (3 048 mm) au-dessus du plancher de la cour d’évacuation.

source: Where an elevation change of 30 inches (762 mm) or less occurs between a cross aisle and the adjacent floor or grade below, guards not less than 26 inches (660 mm) above the aisle floor shall be provided.
fr_ca: Lorsqu’une différence de niveau de 30 po (762 mm) ou moins existe entre une allée transversale et le plancher ou le sol adjacent situé en contrebas, des garde-corps d’au moins 26 po (660 mm) au-dessus du plancher de l’allée doivent être prévus.

source: Where an emergency exists, the building official shall not be required to give a written notice prior to stopping the work.
fr_ca: En cas d'urgence, le responsable de la construction n'est pas tenu de donner un avis écrit avant d'arrêter les travaux.

source: Where an interior exit stairway or ramp is extended to an exit discharge or a public way by an exit passageway, the exit passageway shall comply with Section 1023.3.1.
fr_ca: Lorsqu'un escalier ou une rampe d'issue intérieurs sont prolongés jusqu'à une issue d'évacuation ou une voie publique par un passage d'issue, le passage d'issue doit se conformer à la section 1023.3.1.

source: Where an occupied roof has an assembly occupancy with an occupant load exceeding 100 for Group A-2 and 300 for other Group A occupancies, all floors between the occupied roof and the level of exit discharge shall be equipped with an automatic sprinkler system in accordance with Section 903.3.1.1 or 903.3.1.2.
fr_ca: Lorsqu’un toit occupé comporte un usage d’assemblée dont la charge d’occupants est supérieure à 100 personnes pour le groupe A-2 et à 300 personnes pour les autres usages du groupe A, tous les planchers situés entre le toit occupé et le niveau de l'issue d’évacuation menant à l’extérieur doivent être équipés d’un système d’extincteurs automatiques conformément à la section 903.3.1.1 ou 903.3.1.2.

source: Where an overflow is installed, the overflow shall be not less than 11/2 inches (38 mm) in diameter.
fr_ca: Lorsqu'un trop-plein est installé, il doit avoir un diamètre d'au moins 11/2 po [38 mm].

source: Where any chair in the row does not have an automatic or self-rising seat, the measurements shall be made with the seat in the down position.
fr_ca: Lorsqu’un siège quelconque de la rangée n’est pas muni d’un mécanisme de relevage automatique ou ne se relève pas automatiquement, les mesures doivent être effectuées lorsque le siège est en position abaissée.

source: Where any portion of a basement is located more than 75 feet (22 860 mm) from openings required by Section 903.2.11.1, or where walls, partitions or other obstructions are installed that restrict the application of water from hose streams, the basement shall be equipped throughout with an approved automatic sprinkler system.
fr_ca: Lorsque toute partie d’un sous-sol est située à plus de 75 pieds (22 860 mm) des ouvertures requises par la section 903.2.11.1, ou lorsque des murs, cloisons ou autres obstacles sont installés de manière à restreindre l’application de l’eau provenant de lances d’incendie, le sous-sol doit être entièrement équipé d’un système d’extincteurs automatiques approuvé.

source: Where approved, the prerecorded announcement is allowed to be manually deactivated for a period of time, not to exceed 3 minutes, for the sole purpose of allowing a live voice announcement from an approved, constantly attended location.
fr_ca: Lorsque cela est approuvé, l’annonce préenregistrée peut être désactivée manuellement pendant une période d’au plus 3 minutes, uniquement afin de permettre la diffusion d’une annonce en direct à partir d’un endroit approuvé constamment surveillé.

source: Where armrests are provided on seating in the immediate area of designated aisle seats, folding or retractable armrests shall be provided on the aisle side of the designated aisle seat.
fr_ca: Lorsque des accoudoirs sont prévus sur les SIÈGES situés à proximité immédiate des SIÈGES D'ALLÉE DÉSIGNÉS, il faut prévoir des accoudoirs rabattables ou rétractables du côté allée du SIÈGE D'ALLÉE DÉSIGNÉ.

source: Where arrival points are not within 50 feet (15 240 mm) of the entrance, the closest arrival point shall be used to determine access unless that arrival point serves the story required by Section 1108.7.1.1.
fr_ca: Lorsque les points d’arrivée ne sont pas situés à moins de 50 pi (15 240 mm) de l’entrée, le point d’arrivée le plus proche doit être utilisé pour déterminer l’accès, sauf si ce point d’arrivée dessert l’étage exigé par la section 1108.7.1.1.

source: Where assembly seating has multiple distinct seating areas with amenities that differ from other distinct seating areas, wheelchair space locations shall be provided within each distinct seating area.
fr_ca: Lorsque les SIÈGES d'un lieu de rassemblement comportent plusieurs zones de sièges distinctes dotées d'équipements différents de ceux des autres zones de sièges distinctes, des emplacements pour fauteuils roulants doivent être prévus dans chaque zone de sièges distincte.

source: Where automatic sprinkler systems or smoke detectors are installed, such systems or detectors shall be connected to the building fire alarm system.
fr_ca: Lorsque des systèmes d’extincteurs automatiques ou des détecteurs de fumée sont installés, ces systèmes ou détecteurs doivent être raccordés au système d’alarme d’incendie du bâtiment.

source: Where balconies or other elevated walking surfaces have weather-exposed surfaces, and the structural framing is protected by an impervious moisture barrier, all elements of the impervious moisture barrier system shall not be concealed until inspected and approved.
fr_ca: Lorsque les balcons ou autres surfaces de circulation surélevées comportent des surfaces exposées aux intempéries et que l’ossature structurale est protégée par une membrane pare-humidité imperméable, aucun élément du système de membrane pare-humidité imperméable ne doit être dissimulé avant d’avoir été inspecté et approuvé.

source: Where balconies or other elevated walking surfaces have weather-exposed surfaces, and the structural framing is protected by an impervious moisture barrier, the construction documents shall include details for all elements of the impervious moisture barrier system.
fr_ca: Lorsque les balcons ou autres surfaces de circulation surélevées comportent des surfaces exposées aux intempéries et que l’ossature structurale est protégée par une membrane pare-humidité imperméable, les documents de construction doivent inclure les détails de tous les éléments du système de membrane pare-humidité imperméable.

source: Where basements contain one or more sleeping rooms, an emergency escape and rescue opening shall be required in each sleeping room, but shall not be required in adjoining areas of the basement.
fr_ca: Lorsque les sous-sols contiennent une ou plusieurs chambres, une ouverture d'évacuation et de sauvetage d'urgence est exigée dans chaque chambre, mais n'est pas exigée dans les zones adjacentes du sous-sol.

source: Where chairs have automatic or self-rising seats, the measurement shall be made with seats in the raised position.
fr_ca: Lorsque les sièges sont munis d’un mécanisme de relevage automatique ou se relèvent automatiquement, la mesure doit être effectuée lorsque les sièges sont en position relevée.

source: Where changes in direction of travel occur at landings provided between ramp runs, the landing shall be 60 inches by 60 inches (1524 mm by 1524 mm) minimum.
fr_ca: Lorsque des changements de direction du déplacement se produisent aux paliers prévus entre les volées de rampe, le palier doit avoir une dimension minimale de 60 pouces sur 60 pouces (1 524 mm sur 1 524 mm).

source: Where charging stations are provided at wheelchair space locations, they shall comply with Section 906.
fr_ca: Lorsque des bornes de recharge sont prévues aux emplacements pour fauteuils roulants, elles doivent être conformes à la section 906.

source: Where clear openings are provided, they shall be located so as to minimize the accumulation of smoke or toxic gases.
fr_ca: Lorsque des ouvertures libres sont prévues, elles doivent être situées de manière à réduire au minimum l’accumulation de fumée ou de gaz toxiques.

source: Where cold-formed steel framing is used, the location where the 1/2-inch (12.7 mm) bolts are used to attach the straps to the framing shall be reinforced with not less than a 3-inch × 3-inch × 0.229-inch (76 mm × 76 mm × 5.8 mm) steel plate on top of the strap that is screwed to the framing with not fewer than seven No. 6 screws for each bolt.
fr_ca: Lorsqu'une ossature en acier profilé à froid est utilisée, l'emplacement où les boulons de 1/2 po [12,7 mm] sont utilisés pour fixer les sangles à l'ossature doit être renforcé avec au moins une plaque d'acier de 3 po × 3 po × 0,229 po [76 mm × 76 mm × 5,8 mm] au-dessus de la sangle, qui est vissée à l'ossature avec au moins sept vis n° 6 pour chaque boulon.

source: Where design flood elevations are not specified, they shall be established in accordance with Section 1612.3.1.
fr_ca: Lorsque les élévations de crue de conception ne sont pas spécifiées, elles doivent être établies conformément à la section 1612.3.1.

source: Where direct access is provided for pedestrians from a pedestrian tunnel or elevated walkway to a building or facility, at least one entrance to the building or facility from each tunnel or walkway shall be accessible.
fr_ca: Lorsqu’un accès direct est aménagé pour les piétons entre un tunnel piétonnier ou une passerelle surélevée et un bâtiment ou un établissement, au moins une entrée du bâtiment ou de l’établissement depuis chaque tunnel ou passerelle doit être accessible.

source: Where doorways are located adjacent to a ramp landing, maneuvering clearances required by ICC A117.1 are permitted to overlap the required landing area.
fr_ca: Lorsque des ouvertures de porte sont situées à côté d'un palier de rampe, les espaces de dégagement exigés par l'ICC A117.1 peuvent chevaucher la zone de palier exigée.

source: Where drinking fountains are primarily for children’s use, drinking fountains for people using wheelchairs shall be permitted to comply with the children’s provisions in ICC A117.1 and drinking fountains for standing children shall be permitted.
fr_ca: Lorsque les abreuvoirs sont principalement destinés à être utilisés par des enfants, les abreuvoirs destinés aux personnes utilisant un fauteuil roulant peuvent être conformes aux dispositions relatives aux enfants de la norme ICC A117.1, et des abreuvoirs destinés aux enfants en position debout peuvent être prévus.

source: Where drinking fountains are provided on an exterior site, on a floor or within a secured area, the drinking fountains shall be provided in accordance with Sections 1109.5.1 and 1109.5.2.
fr_ca: Lorsque des abreuvoirs sont prévus sur un site extérieur, sur un étage ou dans une zone sécurisée, ils doivent être conformes aux sections 1109.5.1 et 1109.5.2.

source: Where drinking fountains for persons using wheelchairs and drinking fountains for standing persons are not located adjacent to each other, directional signage shall be provided indicating the location of the other drinking fountains.
fr_ca: Lorsque les abreuvoirs destinés aux personnes utilisant un fauteuil roulant et les abreuvoirs destinés aux personnes en position debout ne sont pas situés l’un à côté de l’autre, une signalisation directionnelle doit être prévue pour indiquer l’emplacement des autres abreuvoirs.

source: Where each shower space is not provided with an individual waste outlet, the waste outlet shall be located and the floor pitched so that waste from one shower does not flow over the floor area serving another shower.
fr_ca: Lorsque chaque espace de douche n'est pas équipé d'une évacuation individuelle, l'évacuation doit être située et le plancher incliné de manière à ce que les eaux usées d'une douche ne s'écoulent pas sur la surface de plancher desservant une autre douche.

source: Where elevator service in the building provides an accessible route only to the lowest story containing dwelling units or sleeping units intended to be occupied as a residence, only the units on that story that are intended to be occupied as a residence are required to be Type B units.
fr_ca: Lorsque le service d’ascenseur du bâtiment permet un itinéraire accessible uniquement jusqu’à l’étage le plus bas comportant des logements ou des unités de couchage destinés à être occupés comme résidence, seuls les logements et les unités de couchage destinés à être occupés comme résidence situés à cet étage doivent être des unités de type B.

source: Where elevator service is not provided in a structure, only the dwelling units and sleeping units that are located on stories indicated in Sections 1108.7.1.1 and 1108.7.1.2 are required to be Type A units and Type B units, respectively.
fr_ca: Lorsque aucun service d’ascenseur n’est prévu dans un bâtiment, seuls les logements et les unités de couchage situés aux étages indiqués aux sections 1108.7.1.1 et 1108.7.1.2 doivent respectivement être des unités de type A et des unités de type B.

source: Where elevators are provided in a high-rise building for accessible means of egress, fire service access or occupant self-evacuation, the standby power system shall also comply with Sections 1009.4, 3007 or 3008, as applicable.
fr_ca: Lorsque des ascenseurs sont prévus dans un bâtiment de grande hauteur pour servir de moyen d’évacuation accessible, pour l’accès des services d’incendie ou pour l’auto-évacuation des occupants, le système d’alimentation électrique de secours doit également être conforme aux articles 1009.4, 3007 ou 3008, selon le cas.

source: Where entrances used only by inmates or detainees and security personnel are provided at judicial facilities, detention facilities or correctional facilities, at least one such entrance shall be accessible.
fr_ca: Lorsque des entrées utilisées uniquement par les détenus ou les personnes incarcérées et le personnel de sécurité sont prévues dans des établissements judiciaires, des établissements de détention ou des établissements correctionnels, au moins une de ces entrées doit être accessible.

source: Where equipment replacements and repairs must be performed in an emergency situation, the permit application shall be submitted within the next working business day to the building official.
fr_ca: Lorsque le remplacement ou la réparation d’équipements doit être effectué en situation d’urgence, la demande de permis doit être présentée au responsable de la construction au plus tard le jour ouvrable suivant.

source: Where equivalent information is provided in an audible manner, variable message signs are not required to comply with ICC A117.1.
fr_ca: Lorsque des renseignements équivalents sont fournis de façon audible, les panneaux à messages variables ne sont pas tenus d’être conformes à la norme ICC A117.1.

source: Where exterior deck, patio or balcony surface materials are impervious, the finished exterior impervious surface shall be 4 inches (100 mm) maximum below the floor level of the adjacent interior spaces of the unit.
fr_ca: Lorsque les matériaux de surface de la terrasse extérieure, du patio ou du balcon sont imperméables, la surface imperméable extérieure finie doit se trouver au maximum 4 po [100 mm] en dessous du niveau du sol des espaces intérieurs adjacents de l'unité.

source: Where exterior landings or floors serving the required egress door are not at grade, they shall be provided with access to grade by means of a ramp in accordance with Section R311.8 or a stairway in accordance with Section R311.7.
fr_ca: Lorsque les paliers ou les planchers extérieurs desservant la porte d'évacuation requise ne sont pas au niveau du sol, il faut prévoir un accès au niveau du sol au moyen d'une rampe selon la section R311.8 ou d'un escalier selon la section R311.7.
